import {readable} from 'svelte/store';

const information_json = {
    zh: {
        school_ids: {
            "白維田": 1,
            "蒲欣妤": 2,
            "許睿智": 3,
            "朱紹筠": 4,
            "張珈瑄": 6,
            "吳黛葳": 5,
            "高哲淯": 7,
            "蔡尚騰": 8,
            "翁國愷": 10,
            // "葉志翔": 11,
            // "張沛晴": 13,
            "李頡": 14,
            "余宗霖": 15,
            "蔡政澔": 16,
            "唐昱翔": 17,
            "潘玟瑜": 18,
            "廖婉淩": 19,
            "江愷希": 20,
            "莊恩齊": 21,
            "陳政維": 22,
            "吳佩純": 23,
            // "何晨瑜": 24,
            "陳妍姍": 25,
            "林琮澔": 26,
            "陳誌陽": 27,
            // "魏惇儀": 28,
            "簡祐呈": 29,
            "林慧儒": 30,
            "徐浩瀚": 31,
            "邱傑義": 32,
            "韓承芯": 33,
            "劉吉榮": 34,
            "楊茗柯": 35,
            "胡品孜": 36,
            "李士朋": 37,
            "王嘉郁": 38,
            "丁常恩": 39,
            "王暉蒽": 40,
            "朱亦萱": 42,
            "蘇乃俞": 58,
            "林珈誼": 59,
            "周詩涵": 60,
        },
        exhibition: {},
        art_teams: [
            {
                id: 0,
                members: [
                    {
                        name: "莊恩齊",
                        title: "組長",
                    },
                    {
                        name: "陳政維",
                        title: "3D 建模、動畫設計",
                    },
                    {
                        name: "邱傑義",
                        title: "網頁程式設計",
                    },
                    {
                        name: "劉吉榮",
                        title: "3D 互動設計",
                    }
                ],
                title: "弗朗提爾貳號",
                format: "網路程式運算影像",
                description: "21世紀以降，互聯網已然發展成與現實相互糾纏的鏡像世界，使用介面的演進，大大加速了這一進程，太空殖民的時代尚未到來，互聯網可能先一步成為近未來的殖民地。本作接續其前作 FRONTIER_01，以不同比例的手機頻幕，播放三個月展期以來所累積的數千筆，觀眾所提供的圖文資料，並使用這些資料建設一座龐雜卻有序的環形太空站。身處世界各地的人們，不約而同地透過某種介面登上了這座太空站，共構出現今的互聯網生態，持續開拓 The Next Frontier。",
                media: "膠合玻璃, 電子材料, 彩色有聲, 18'00\", 彩⾊/有聲, 2023",
                size: "200cm x 200cm x 200cm",
                record: {
                    images: [0, 1],
                    videos: {
                        youtube: "91JGyan6MY8"
                    },
                }
            },
            {
                id: 1,
                members: [
                    {
                        name: "王暉蒽",
                        title: "",
                    },
                    {
                        name: "徐浩瀚",
                        title: "",
                    },
                    {
                        name: "朱亦萱",
                        title: "",
                    },
                    {
                        name: "蒲欣妤",
                        title: "",
                    },
                    {
                        name: "唐昱翔",
                        title: "",
                    },
                    {
                        name: "蔡尚騰",
                        title: "",
                    }
                ],
                title: "展間．魅影",
                format: "",
                description: "《展間魅影》與整個展覽空間產生聯動，觀眾在此空間中不必循規蹈矩，不必逐一閱覽。 以往，作品常被視為觀看的主體。而本作品希望再現被忽視的觀者身體經驗，藉由感測器的捕捉，重新轉化成作品的一部分。觀看主體行為的倒置，迫使觀眾重新思考自身之於展場的關係，並藉此推演觀眾一詞的定義——觀眾為非物質性的存在。觀眾的意涵早已顛覆，這系列作品也試圖讓觀眾重新思考“觀眾之於觀眾”的意涵。",
                media: "影像互動裝置",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 2,
                members: [
                    {
                        name: "胡品孜",
                        title: "",
                    },
                    {
                        name: "廖婉凌",
                        title: "",
                    },
                    {
                        name: "白維田",
                        title: "",
                    },
                    {
                        name: "吳佩純",
                        title: "",
                    },
                    {
                        name: "吳黛葳",
                        title: "",
                    }
                ],
                title: "在高塔上做著白日夢",
                format: "影像裝置",
                description: " 以塔作為載體，將幻想中的世界劃分為數個敘事空間，融合現實與虛構的影像，探索虛構世界的同時，影像作為思考節點，使觀者意識到世界中的矛盾與真實， 並討論對此種狀態的質疑與反思。",
                media: "",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 3,
                members: [
                    {
                        name: "楊茗柯",
                        title: "",
                    },
                    {
                        name: "李頡",
                        title: "",
                    },
                    {
                        name: "林珈誼",
                        title: "",
                    },
                    {
                        name: "李士朋",
                        title: "",
                    },
                    {
                        name: "韓承芯",
                        title: "",
                    },
                    {
                        name: "林慧儒",
                        title: "",
                    }
                ],
                title: "!Virtual",
                format: "虛擬實境互動遊戲",
                description: "認知的交流時常發生於群體之間，兩人、社會到國家存在著無形的網狀溝通系統，因此日常談話、爭執、情感...甚至宗教信仰、政治發展中，認知皆不斷磨合、重組產生新的面貌。<br>近年NFT、元宇宙、ChatGPT…等新型態科技的出現，將人類帶往下一段未知的生存環境，而 「真實與虛擬」的定義也逐漸轉變成混沌或漂浮的狀態。以人類的視角而言「虛擬」是被創造的產物，理由即是人類擁有解釋虛擬世界中所有變數的能力，因此能夠定義它為虛擬，反觀人類世界若不是由他人所造，同理我們應當能夠解釋眼前世界的全貌，並且存在著標準答案，眾人對於世界的想像也必須相同，然而事實上人類發展出多種對於真實的定義，如今各種宗教信仰與科學家之間產生的爭執,  反向體現出我們無法斷定身處的世界及是「絕對真實」，  只能說明人類試圖為眼前的世界尋找真理。<br>假設人類世界的真實性是一個混沌、無法定義的狀態，身為創作者又是基於甚麼立場去談論「虛擬」，VR技術作為虛擬的代表物，而創作者失去絕對真實的立場製作一款虛擬實境遊戲時，玩家又該如何理解眼前的影像世界, 然而同時間每位玩家於相同影像空間中，卻獲得不同資訊時，玩家們之間又該如何磨合與重組出影像世界的真理，如同人類世界對於真實性的討論般，既是統一又是分歧。<br>此次創作不以虛實的角度去看待AR、VR、MR、XR等實境技術，試圖以皆實或皆虛的狀態去設計一套具有高度互動性的體感遊戲，從遊戲機制、影像視覺到互動技術的應用，皆遵守著多方資訊平衡與對等的邏輯去設計與製作，嘗試刺激玩家思考或定義何謂「主觀真實」。",
                media: "",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 4,
                members: [
                    {
                        name: "高哲淯",
                        title: "",
                    },
                    {
                        name: "簡祐呈",
                        title: "",
                    },
                    {
                        name: "蘇乃俞",
                        title: "",
                    }
                ],
                title: "BizarreParadoxcallyMargin",
                format: "單頻道錄像",
                description: "當今動畫技術中常以完全自動化的動態捕捉（motion capture）、後加人為逐幀編輯關鍵幀（keyframe）製成實體轉為虛擬的數位影像。使用動態捕捉的技術時，電腦依據標籤判別人類的動態並建立數位技術下「人類身體」的影像；為使影像更趨近於真實樣貌，人類再逐幀編輯關鍵幀（keyframe）重複塑形「人類身體」。<br>本作以此技術創造上所描述的「人類身體」（魁儡），文本內容透過劇情敘事和魁儡的自述解構人與電腦因「生成人類的方法」邏輯迥異進而產生的落差，同時經由一系列與魁儡的對話回應人類與數位科技相處的現狀。",
                media: "彩色/有聲 2023（影片長度後期補上）",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 5,
                members: [
                    {
                        name: "陳誌陽",
                        title: "",
                    },
                    {
                        name: "陳妍姍",
                        title: "",
                    },
                    {
                        name: "江愷希",
                        title: "",
                    },
                    {
                        name: "張珈瑄",
                        title: "",
                    },
                ],
                title: "夢尼瑪",
                format: "影像裝置",
                description: "夢尼瑪 Monema，挪用自電影詞彙Cinema 。意在製作一種以敘夢為目的，不同於傳統錄像之影像敘事工具的敘夢影像、空間與邏輯。<br>夢組以往的創作，多時會擬定某個夢境的瞬間或框架：一個夢的敘事容器，再將創作期間成員彼此的夢境加入容器中，並以拼貼的方式重塑聲響、文字與影像內容；考慮到語言框架對於各自夢境的侷限，因此在統整夢境文字時，以意識流並集體同時書寫的方式，製作突破語言敘事的慣性與限制，並以成員的夢境為資料庫，生成集體夢境。<br>而本次的作品為類劇場的影像裝置，觀眾需於軌道上自行控制前後，並觀看異空間般的夢境，可以單向由起點至終點的觀看，也可以再次回到原點，如夢境般無固定邏輯；作品與展場的空間斷裂感，作為分隔夢境與現實的介面，觀眾成為夢境的參與者，以實體的肉身來體驗趨向虛擬的夢境空間，以達到超越傳統敘事影像的敘夢。",
                media: "視場地而定, 2023",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 6,
                members: [
                    {
                        name: "朱紹筠",
                        title: "",
                    },
                    {
                        name: "王嘉郁",
                        title: "",
                    },
                    {
                        name: "翁國愷",
                        title: "",
                    }
                ],
                title: "空＿集合",
                format: "聲音裝置",
                description: "作品中，透過18個喇叭作為各自獨立的發聲體(speaker)，在過程中成為空間裡的某個物件，帶著不同的聲音扮演好自己的角色。雖然帶著各自的個體差異，但卻也是在這樣的關係中，個體之間彼此溝通 、各司其職，努力形塑出一個更完整的聲場。<br>回應到過去生命經驗中，與其他個體間的碰撞，儘管時常感到不對頻或難以共鳴，卻也是這樣的彼此互補成一個整體。<br>個體間的差異與多樣性使彼此補齊彼此的缺陷，這也是在創作過程中慢慢體察而來，也期許觀眾站在我們這個後知後覺的產物-即作品本 身之後-能夠帶著各自的延伸與啟發回到各自的日常中，或許能在生命中激起某些漣漪與迴盪。",
                media: "",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 7,
                members: [
                    {
                        name: "丁常恩",
                        title: "",
                    },
                    {
                        name: "蔡政澔",
                        title: "",
                    }
                ],
                title: "燈火闌珊處",
                format: "影像裝置",
                description: "日常中感應器的應用不勝枚舉，其中感光用途的「光敏電阻」被使用廣泛。當感光的感應器與燈具形成迴路，並透過「無光送電、發光阻電」，一來一往則形成相互抗衡甚至抵觸的微妙悖論。<br>作品關注「光、感應與迴路」所產生的相互連動與牽制關係，當自動感測成為常態，元件及個體、系統與結構之間如何構成相互辯證的關係。延伸至日常切面與生命經驗的痕跡，嘗試尋找認知中矛盾與悖論的節點，建構一種物理上的交鋒，書寫一種感知與經驗的共鳴。<br>光線灑下，或和緩或劇烈的映入眼簾，感知的步伐總是後知後覺 ——— 原來，已是燈火闌珊。",
                media: "雙頻道錄像、燈泡、光敏電阻、聚光燈、壓克力、鋁擠型",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 8,
                members: [
                    {
                        name: "周詩涵",
                        title: "",
                    }
                ],
                title: "無題",
                format: "",
                description: "",
                media: "",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 9,
                members: [
                    {
                        name: "余宗霖",
                        title: "",
                    }
                ],
                title: "◯",
                format: "單頻道動畫影像",
                description: "靈魂，如同經過時間沖刷後，各種經驗施予壓力堆加壓縮，而一層層留下的化石痕跡。<br>靈魂的輪廓會是什麼樣子呢？又是什麼鑄刻造就靈魂的形狀的?<br>軀殼死亡後，最終靈魂又會歸去何方呢？<br>死亡離我們是如此的接近又遙遠。<br>而在安穩的日常中，<br>偶爾腦中突然冒出的小聲音，<br>產生對於無常以及自身本質無意義的恐慌、失落。<br>對於生死的想像，每個文化都有不同的詮釋，<br>但同時在這些差異之中，卻又有許多相似的描述。<br>這件作品，融合了各個文化中，對於死後世界想像的相似之處，<br>也展現了藝術家對於生、死以及靈魂本質的個人獨特想像。<br>希望觀眾能在觀賞作品、在自己的聯想中優游的同時，<br>還能從作品之中獲得心靈上一絲絲安穩、和平的寧靜。<br>而作品名稱由符號◯來表達的理由，是希望能夠跨越各語言之間，<br>直接以最直覺、最單純的視覺符號來表示。<br>但想要如何用文字、語言來稱呼這件作品，完全取決於觀者，是自由憑人想像的。",
                media: "",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 10,
                members: [
                    {
                        name: "許睿智",
                        title: "",
                    }
                ],
                title: "死循環",
                format: "",
                description: "",
                media: "",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 11,
                members: [
                    {
                        name: "潘玟瑜",
                        title: "",
                    }
                ],
                title: "Finding",
                format: "",
                description: "",
                media: "",
                size: "", record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            },
            {
                id: 12,
                members: [
                    {
                        name: "林琮澔",
                        title: "",
                    }
                ],
                title: "Non-stop",
                format: "",
                description: "",
                media: "",
                size: "",
                record: {
                    images: [0, 1],
                    videos: [0, 1]
                }
            }
        ],
        admins: [
            {
                id: 0,
                department: "總召",
                members: [
                    {
                        name: "徐浩瀚",
                        title: "總召",
                    },
                    {
                        name: "王嘉郁",
                        title: "副總召",
                    }
                ]
            },
            {
                id: 1,
                department: "文書",
                members: [
                    {
                        name: "唐昱翔",
                        title: "文書",
                    },
                    {
                        name: "白維田",
                        title: "文書",
                    }
                ]
            },
            {
                id: 2,
                department: "總務",
                members: [
                    {
                        name: "韓承芯",
                        title: "總務",
                    }
                ]
            },
            {
                id: 3,
                department: "翻譯",
                members: [
                    {
                        name: "劉吉榮",
                        title: "組長",
                    },
                    {
                        name: "林珈誼",
                        title: "組員",
                    }
                ]
            },
            {
                id: 4,
                department: "視覺組",
                members: [
                    {
                        name: "翁國愷",
                        title: "組長",
                    },
                    {
                        name: "簡祐呈",
                        title: "影片",
                    },
                    {
                        name: "陳政維",
                        title: "影片",
                    },
                    {
                        name: "蔡政澔",
                        title: "文宣",
                    },
                    {
                        name: "吳佩純",
                        title: "文宣",
                    },
                    {
                        name: "胡品孜",
                        title: "文宣",
                    },
                    {
                        name: "廖婉淩",
                        title: "商品",
                    },
                    {
                        name: "周詩涵",
                        title: "商品",
                    }
                ]
            },
            {
                id: 5,
                department: "公關組",
                members: [
                    {
                        name: "陳妍姍",
                        title: "組長",
                    },
                    {
                        name: "林慧儒",
                        title: "贊助",
                    },
                    {
                        name: "楊茗柯",
                        title: "贊助",
                    },
                    {
                        name: "李士朋",
                        title: "廣告",
                    },
                    {
                        name: "余宗霖",
                        title: "廣告",
                    },
                    {
                        name: "王暉蒽",
                        title: "廣告",
                    }
                ]
            },
            {
                id: 6,
                department: "活動組",
                members: [
                    {
                        name: "陳誌陽",
                        title: "組長",
                    },
                    {
                        name: "江愷希",
                        title: "企劃",
                    },
                    {
                        name: "張珈瑄",
                        title: "企劃",
                    },
                    {
                        name: "丁常恩",
                        title: "組員",
                    }
                ]
            },
            {
                id: 7,
                department: "佈展組",
                members: [
                    {
                        name: "李頡",
                        title: "組長",
                    },
                    {
                        name: "高哲淯",
                        title: "組員",
                    },
                    {
                        name: "蒲欣妤",
                        title: "組員",
                    },
                    {
                        name: "吳黛葳",
                        title: "組員",
                    },
                    {
                        name: "朱紹筠",
                        title: "組員",
                    },
                    {
                        name: "邱傑義",
                        title: "組員",
                    }
                ]
            },
            {
                id: 8,
                department: "事務組",
                members: [
                    {
                        name: "朱亦萱",
                        title: "組長",
                    },
                    {
                        name: "潘玟瑜",
                        title: "組員",
                    },
                    {
                        name: "劉吉榮",
                        title: "組員",
                    },
                    {
                        name: "蔡尚騰",
                        title: "機動",
                    }
                ]
            },
            {
                id: 9,
                department: "紀錄組",
                members: [
                    {
                        name: "莊恩齊",
                        title: "組長",
                    },
                    {
                        name: "許睿智",
                        title: "組員",
                    },
                    {
                        name: "林琮澔",
                        title: "組員",
                    }
                ]
            },
            {
                id: 10,
                department: "網頁組",
                members: [
                    {
                        name: "邱傑義",
                        title: "組長",
                    },
                    {
                        name: "李士朋",
                        title: "組員",
                    },
                    {
                        name: "林珈誼",
                        title: "組員",
                    },
                    {
                        name: "劉吉榮",
                        title: "組員",
                    }
                ]
            }
        ]
    },
}
export const information = readable(information_json);
// implementation goes here

